---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn1
source: html/d6be973b-2c38-4a5e-55c7-caadc74f55a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn1 Property

"Exterior Major Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientFrontDirn1 { get; }
```